[{"title":"Third Beta of DownThemAll 3.0","date":"2013-02-20","md_body":"DownThemall! 3.0b3, which is the third preview release of the upcoming Version 3.0, was just released. It is indented for users willing to cope with bleeding edge software and reporting issues back to us.\n\nThis new release is the result of a couple of years of development, and lately focused on taking advantage of recent mozilla technologies, incl. restartless add-ons, asynchronous I/O to make things snappy and better platform integration. It also brings a lot of other major and minor new and improved features and bug fixes.     \n\nIn this beta version, I profiled and optimized various common performance issues, most notably with Download Queue Search/Column Filters and also speeding up the loading and closing of the Manager window.     \n\nAdditionally, this release addresses some important fixes for problems uncovered in the previous Beta releases.\n\n[Get DownThemAll! 3.0 Beta 3, release notes and install options](http://www.downthemall.net/main/install-it/downthemall-3-0-beta-3/)\n\nI’d like to take this opportunity to thank [Benoit Girard](http://benoitgirard.wordpress.com/), [Anton Kovalyov](http://anton.kovalyov.net/2012/12/17/firefox-profiler/), Alex Crichton, the Mozilla Snappy and SPS folks and whoever else contributed for making the awesome Gecko Profiler possible, first as an add-on and now even in the Developer Tools of the latest Firefox Nightlies!     \n\nThat particular tool tremendously helped optimize DTA code in the past, in particular when developing this latest Beta release. Before that  runtime profiling was a very tedious job and sometimes when involved patching up Firefox itself to get usable results. If you’re a web developer or add-on author, I suggest you give it a try. For now, there isn’t much documentation available, but I think for the most part this thing is pretty self-explanatory.\n\nThanks for testing     \nNils – on behalf of the team"},{"title":"Second Beta of DownThemAll! 3.0","date":"2013-02-12","md_body":"DownThemall! 3.0b2, which is the second preview release of the upcoming Version 3.0, was just released. It is indented for users willing to cope with bleeding edge software and reporting issues back to us.\n\nThis new release is the result of a couple of years of development, and lately focus on taking advantage of recent mozilla technologies, incl. restartless add-ons, asynchronous I/O to make things snappy and better platform integration. It also brings a lot of other major and minor new and improved features and bug fixes.     \n\nAdditionally, it addresses some important fixes for problems uncovered in the Beta 1.\n\n[Get DownThemAll! 3.0 Beta 2, release notes and install options](http://www.downthemall.net/main/install-it/downthemall-3-0-beta-2/)\n\nThanks for testing     \nNils – on behalf of the team"},{"title":"First Beta of DownThemAll 3.0","date":"2013-01-26","md_body":"DownThemall! 3.0b1, which is the first preview release of the upcoming Version 3.0, was just released. It is indented for users willing to cope with bleeding edge software and reporting issues back to us.\n\nThis new release is the result of a couple of years of development, and lately focus on taking advantage of recent mozilla technologies, incl. restartless add-ons, asynchronous I/O to make things snappy and better platform integration. It also brings a lot of other major and minor new and improved features and bug fixes.\n\n[Get DownThemAll! 3.0 Beta 1 release notes and install options](http://www.downthemall.net/main/install-it/downthemall-3-0-beta-1/)\n\nThanks for testing     \nNils – on behalf of the team"},{"title":"DownThemAll! 2.0.15 released","date":"2012-09-04","md_body":"Version 2.0.15 was just released. It is a maintenance release that addresses issues with drag and drop handling.\n\n[Release notes and download](http://www.downthemall.net/main/install-it/downthemall-2-0-15/)"},{"title":"DownThemAll! 2.0.14 released","date":"2012-08-30","md_body":"DownThemAll! 2.0.14 was just released. It is a maintenance release that only addresses bug fixes and compatibility issues and translation updates.\n\n[Release notes and download](http://www.downthemall.net/main/install-it/downthemall-2-0-14/)"},{"title":"DownThemAll! 2.0.13 released","date":"2012-02-10","md_body":"DownThemAll! 2.0.13 was just released. It is a maintenance release that only addresses bug fixes and compatibility issues.\n\nThis version hopefully fixes some issues with the Evernote add-on, and contains updated translations.\n\n[Release notes and download](http://www.downthemall.net/main/install-it/downthemall-2-0-13/)"},{"title":"DownThemAll! 2.0.12","date":"2012-01-27","md_body":"DownThemAll! 2.0.12 was just released. It is a maintenance release that only addresses bug fixes and compatibility issues.\n\nThis version fixes some issues with post-replay and revamps the Metalink parser to be compatible with future Firefox versions.\n\n[Release notes and download](http://www.downthemall.net/main/install-it/downthemall-2-0-12/)"},{"title":"DownThemAll! 2.0.11 released","date":"2012-01-14","md_body":"DownThemAll! 2.0.11 was just released, which is a maintenance and bugfix release.     \n\nVersion 2.0.11 fixes an issue with download error recovery and restores functioning post-replay along with some minor issue fixes.\n\n[Release notes and download](http://www.downthemall.net/main/install-it/downthemall-2-0-11/)"},{"title":"DownThemAll! 2.0.10 released","date":"2011-12-31","md_body":"Version 2.0.10 fixes issues with Filesonic premium downloads via the Save-As window and broken FTP resuming.\n\n[Installation and release notes](http://www.downthemall.net/main/install-it/downthemall-2-0-10/)"},{"title":"DownThemAll! 2.0.8 released","date":"2011-10-10","md_body":"Version 2.0.8 fixes compatibility with Firefox 8.\n\n[Installation and release notes](http://www.downthemall.net/main/install-it/downthemall-2-0-8/)"},{"title":"DownThemAll! 2.0.7 released","date":"2011-06-12","md_body":"Version 2.0.6 fixes some potential and verified minor memory leaks and is now officially marked compatible with Firefox 6 (Aurora, almost Beta).\n\n[Installation and release notes](http://www.downthemall.net/main/install-it/downthemall-2-0-7/)"},{"title":"DownThemAll! 2.0.6 released","date":"2011-05-26","md_body":"Version 2.0.6 fixes some issues with the previous releases and is now officially marked compatible with Firefox 5 (Beta).\n\n[Installation and release notes](http://www.downthemall.net/main/install-it/downthemall-2-0-6/)"},{"title":"DownThemAll! 2.0.5","date":"2011-05-21","md_body":"DownThemAll! fixes another critical bug that was introduced in 2.0.3:\n\n* Fix: Already started downloads won’t load after a browser restart during the download (downloads that were queued but not started were not affected)We are terrible sorry this slipped our Q/A and would like to thank the users who filed bug reports and provided diagnostic logs.\n\n[Installation and full release notes](http://www.downthemall.net/main/install-it/downthemall-2-0-5/)"},{"title":"DownThemAll! 2.0.4","date":"2011-05-20","md_body":"An embarrassing and to most users rather critical bug slipped into DownThemAll! 2.0.3     \n\nThe bug: When you don’t modify the download queue, then no new downloads will be started after the first 50 ones.\n\nDownThemAll! 2.0.4 was released to address this bug.\n\n[Download and Full release notes](http://www.downthemall.net/main/install-it/downthemall-2-0-4/)"},{"title":"Background File Write 0.4alpha","date":"2011-05-16","md_body":"Basically this extension aims to off-load all file writing to a background “thread”, so that the Firefox user interface stays more snappy, and to avoid certain undesired stuff.\n\nFor more information about the tech-reasoning and source code, please consult the [github page](https://github.com/nmaier/downthemall-asyncwrite).\n\nThe extensions is experimental and only works with DownThemAll! trunk and Firefox 4/5 (32bit) on Windows right now.     \n\nVersion 0.4alpha fixes some issues, including a very minor memory leak, and also switches from Win32 API use to NSPR, so that Mac/Linux versions are now within the reach.\n\n* Install [Firefox 4](http://getfirefox.com/). This is recommended, anyway. :D\n\n* Install the [DownThemAll! Nightly trunk](https://code.downthemall.net/nightly/)\n\n* Install the [extension](https://code.downthemall.net/asyncwrite/dta_asyncwrite-latest.xpi)\n\n* [Tell me about your experiences](https://github.com/nmaier/downthemall-asyncwrite/issues)(Existing users should be offered an automatic update)\n\nPS:     \n\nThe release is now signed by me (Nils Maier)     \n\nInterested developers please note (shameless plug): Not signed using signtool, but [xpisign.py](https://github.com/nmaier/xpisign.py/)"},{"title":"DownThemAll! 2.0.3 released","date":"2011-05-08","md_body":"DownThemAll! 2.0.3 was released. It is a maintenance release that fixes some bugs, in particular adds a work around for filesonic premium downloads, and adds new localizations.\n\nThis add-on version is currently available from our home page, but will become available from addons.mozilla.org shortly.\n\n[Release notes and download](/main/install-it/downthemall-2-0-3/)"},{"title":"Background File Write Extension","date":"2011-04-12","md_body":"I’d like to announce a prototype/experimental extension to DownThemAll! which I call dTa! Background File Write1.     \n\nBasically this extension aims to off-load all file writing to a background “thread”, so that the Firefox user interface stays more snappy, and to avoid certain undesired stuff.\n\nFor more information about the tech-reasoning and source code, please consult the [github page](https://github.com/nmaier/downthemall-asyncwrite).\n\nThe extensions is experimental and only works with DownThemAll! trunk and Firefox 4 (32bit) on Windows right now.\n\n* Install [Firefox 4](http://getfirefox.com/). This is recommended, anyway. :D\n\n* Install the [DownThemAll! Nightly trunk](https://code.downthemall.net/nightly/)\n\n* Install the [extension](https://code.downthemall.net/asyncwrite/dta_asyncwrite-0.3alpha.xpi)\n\n* [Tell me about your experiences](https://github.com/nmaier/downthemall-asyncwrite/issues)Cheers     \n\nNils\n\n1 Yeah, call me the Leonard da Quirm of extension naming :p"},{"title":"DownThemAll! 2.0.2 released","date":"2011-03-11","md_body":"DownThemAll! 2.0.2 was released. It is a maintenance release that fixes some bugs and adds new localizations.\n\nThis add-on version is currently available from our home page, but will become available from addons.mozilla.org shortly.\n\n[Release notes and download](http://www.downthemall.net/main/install-it/downthemall-2-0-2/)"},{"title":"We’re About.com Reader’s Choice Awards finalist again","date":"2011-02-12","md_body":"![](http://about.downthemall.net/img/2011-readers-choice-large.jpg)     \n\nAs we were last year as well, we’re a finalist in the 2011 About.com Reader’s Choice Awards in the category Best Overall (Non-Security) Add-on.\n\nThanks for your nominations. Having been nominated by our users is a great thing in itself. Thanks for your trust and support!\n\nAs always the competition is hard, and as last year, personally I voted for Adblock Plus.\n\nGo to the [Best Overall Add-On (Non-Security) voting](http://browsers.about.com/od/allaboutwebbrowsers/ss/2011-readers-choice-awards-web-browsers-voting_5.htm)     \n\nor visit the [Awards page](http://browsers.about.com/od/allaboutwebbrowsers/ss/2011-readers-choice-awards-web-browsers-voting.htm)."},{"title":"DownThemAll! 2.0.1 released","date":"2011-02-07","md_body":"We’re proud to announce that DownThemAll! 2.0.1 was released.     \n\nIt is a maintenance release.\n\nIt is currently available from our website and on addons.mozilla.org.     \n[Release notes and download](http://www.downthemall.net/main/install-it/downthemall-2-0-1/)"},{"title":"DownThemAll! on GitHub","date":"2011-02-07","md_body":"I just created an official GitHub repository.     \n\nIt’s just a mirror to our Subversion repository, but you’re still welcome to fork it and post pull requests ;)\n\nGitHub: [https://github.com/nmaier/DownThemAll](https://github.com/nmaier/DownThemAll)"},{"title":"DownThemAll! 2.0 released","date":"2011-01-11","md_body":"After more than two years of development, we’re proud to release DownThemAll! 2.0.\n\nDownThemAll! 2.0 includes a lot of new features, refinements and bug fixes, most notably support for Firefox 4, speed limits, mirror management and better platform/OS integration.\n\n**[Get DownThemAll! 2.0](/main/install-it/downthemall-2-0/)**\n\nThis release is digitally signed (by Nils Maier). If you have any problems due to this, please refer to the [Adblock Plus signing related installation troubles page](http://adblockplus.org/en/known-issues#signing).\n\nPlease report any issues you find back to our [bug tracker](https://bugs.downthemall.net/).\n\n– The DownThemAll! team"},{"title":"DownThemAll! 2.0 Beta 5 released","date":"2010-11-07","md_body":"We are proud to release the fifth preview of the upcoming next major version of DownThemAll!.\n\nMore than 1 year of development passed since the last major version. This was mostly due to time constraints, as DownThemAll! is still developed by a small team of three as a hobbyist project.\n\nLots of new features and refinements went into the preview releases, such as speed limits, mirror management, fine-grained connection control, text-link recognition and many more. As of now the 2.0 series can be considered feature-complete. Beta 5 may still contain bugs, but should be ready for daily use in general.\n\nBeta 5 is the first preview release to include translations other than English. Some of the translations are still worked on, so some mistakes might be still present.     \n\nFurthermore Beta 5 fixes some bugs introduced recently into Firefox 4 (4.0b8pre nightlies).\n\n**→ [Download and release notes](http://www.downthemall.net/main/install-it/downthemall-2-0-beta-5/)**\n\nThis release is digitally signed (by Nils Maier). If you have any problems due to this, please refer to the [Adblock Plus signing related installation troubles page](http://adblockplus.org/en/known-issues#signing).\n\nIf you have some crazy, awesome language skills, please consider helping out with translating DownThemAll! to other languages: **[More information](/latest/downthemall-2-0-translation-started/)**\n.\n\nPlease report any issues you find back to our [bug tracker](https://bugs.downthemall.net/).\n\nThanks for testing!"},{"title":"DownThemAll! 2.0 translation started","date":"2010-10-17","md_body":"I uploaded DownThemAll! 2.0 Beta to Babelzilla a few hours ago, so that our awesome voluntary translators from all around the world can start their appreciated work.     \n\nBabelzilla is an open translation platform for all kinds of mozilla extensions where people a collaboratively translate almost a thousand extensions to almost a hundred different languages.\n\nIf your language wasn’t available in the past, or you’d like to help out existing translation teams, then please don’t hesitate and head over to babelzilla!\n\n* [Babelzilla](http://babelzilla.org/)\n\n* [DownThemAll! forum topic](http://www.babelzilla.org/forum/index.php?showtopic=1691)\n\n* [Translator Quick Start Guide](http://babelwiki.babelzilla.org/index.php?title=Quick_Starting_Guide_for_the_extension_translator)\n\n* [Babelzilla Wiki](http://babelwiki.babelzilla.org/)Thanks to all existing and feature translators for your awesome work, not only from us developers but from thousands of DownThemAll! users relying on your translations, as well!"},{"title":"DownThemAll! Beta 4 released","date":"2010-10-13","md_body":"We are proud to release the forth preview of the upcoming next major version of DownThemAll!.\n\nMore than 1 year of development passed since the last major version. This was mostly due to time constraints, as DownThemAll! is still developed by a small team of three as a hobbyist project.\n\nLots of new features and refinements went into the preview releases, such as speed limits, mirror management, fine-grained connection control, text-link recognition and many more. As of now the 2.0 series can be considered feature-complete. Beta 4 may still contain bugs, but should be ready for daily use in general. However, right now only English translations are shipped.\n\n**→ [Download and release notes](http://www.downthemall.net/main/install-it/downthemall-2-0-beta-4/)**\n\nBeta 4 is furthermore the first release to be digitally signed (by Nils Maier). If you have any problems due to this, please refer to the [Adblock Plus signing related installation troubles page](http://adblockplus.org/en/known-issues#signing).\n\nWe’re currently focused on putting new website infrastructure in place and getting 2.0 ready to be translated.\n\nA heads up to fellow developers and Nightly Builds users: I just created a 2.0.x branch, while the “trunk” will continue as “2.1alpha”. If you’d like to follow 2.0.x, you should grab the [2.0.x Nightly](https://code.downthemall.net/nightly/) instead of the trunk one.\n\nPlease report any issues you find back to our [bug tracker](https://bugs.downthemall.net/).\n\nThanks for testing!\n\n**Update**\n (2010/10/14): The initially released version had the wrong extension id, leading to Firefox thinking this was another extension hence resulting in having both an old dTa! and the new beta4 installed simultaneously. I just released a corrected beta4 (same location).\n\nIf you installed beta4 yesterday or today, please uninstall that version and reinstall the new release."},{"title":"DownThemAll! and Firefox 4 betas","date":"2010-08-24","md_body":"First of all we don’t plan to support Firefox 4 in the DownThemAll! 1.1 release series.     \n\nBut DownThemAll! 2.0 will be Firefox 4 compatible!\n\nThe 2.0 Beta releases we did so far already declared support for some older Firefox betas. We won’t however release a new beta version with every Firefox beta. Furthermore the DownThemAll! 2.0 Betas won’t be upgraded to newer Betas (you have to manually install a new beta, or wait for the official 2.0 release).\n\nIf you’d like to use DownThemAll! with current Firefox 4 Betas, then please install our:     \n[Nightly Builds](http://bugs.code.downthemall.net/trac/wiki/NightlyBuilds)!     \n\nThose have the advantage that they are updated once every night, so you’ll always get the most recent stuff with automatic updates. This can, on the other hand, be a downside as well, as those builds can contain more bugs, however they were pretty stable recently. ;) Of course, Firefox 3.6 users are welcomed to try the Nightly Builds as well.\n\nFor a list of changes between DownThemAll! 1.1 and 2.0-dev see e.g. the [dTa 2.0b3 changelog](http://bugs.code.downthemall.net/trac/wiki/ChangeLog/2.0b3)."},{"title":"DownThemAll! 2.0 beta 3","date":"2010-08-01","md_body":"We are proud to release the third preview of the upcoming next major version of DownThemAll!.\n\nMore than 1 year of development passed since the last major version. This was mostly due to time constraints, as DownThemAll! is still developed by a small team of three as a hobbyist project.\n\nLots of new features and refinements went into the preview releases, such as speed limits, mirror management, fine-grained connection control, text-link recognition and many more. As of now the 2.0 series can be considered feature-complete. Beta 3 may still contain bugs, but should be ready for daily use in general. However, right now only English translations are shipped.\n\n**→ [Download and release notes](http://www.downthemall.net/main/install-it/downthemall-2-0-beta-3/)**\n\nPlease report any issues you find back to our [bug tracker](http://bugs.code.downthemall.net/trac).\n\nThanks for testing!"},{"title":"DownThemAll! 2.0 beta 2","date":"2010-07-18","md_body":"We are proud to release the second preview of the upcoming next major version of DownThemAll!.\n\nMore than 1 year of development passed since the last major version. This was mostly due to time constraints, as DownThemAll! is still developed by a small team of three as a hobbyist project.\n\nLots of new features and refinements went into the preview releases, such as speed limits, mirror management, fine-grained connection control, text-link recognition and many more.     \n\nThis new preview release fixes bugs discovered by our users, refines part of the new user interface bits and furthermore adds preliminary Firefox 4.0 Beta support.\n\n**→ [Download and release notes](http://www.downthemall.net/main/install-it/downthemall-2-0-beta-2/)**\n\nAs this is preview software, some features might be still missing or incomplete. Bugs have to be expected.     \n\nPlease report any issues you find back to our [bug tracker](http://bugs.code.downthemall.net/trac).\n\nThanks for testing!"},{"title":"No Safari 5 support","date":"2010-06-09","md_body":"We won’t add Safari 5 extensions support to DownThemAll!, for the very same technical reasons [we won’t add suppport for Chrome](/latest/no-google-chrome-support/).     \n\nI concur with [Giorgio’s assessment](http://hackademix.net/2010/06/08/before-you-ask-no-noscript-on-safari/) that the Safari 5 extension system is even more limited than the Chrome extension system.\n\n[Update]     \n\nAlso see some technical explanations of the fundamental differences between mozilla extensions and Safari/Chrome extensions.\n\n* [Robert Kaiser](http://home.kairo.at/blog/2010-06/the_real_difference_is_the_platform) (Seamonkey)\n\n* [Davide Ficano](http://dafizilla.wordpress.com/2010/06/10/a-survey-on-safari-5-chrome-and-firefox-extensions-api/) (extension developer)– Nils"},{"title":"DownThemAll! 1.1.10 released","date":"2010-05-28","md_body":"We released DownThemAll! Version 1.1.10, which is a maintenance and bugfix release.\n\nThere was an annoying bug causing the drop down lists (directory, mask, filters) not to be saved correctly in some situations.     \n\nOther than this we updated the shipped locales.\n\nYou can get it on [addons.mozilla.org](https://addons.mozilla.org/firefox/201/). You may also want to check out our [release notes](http://www.downthemall.net/main/install-it/downthemall-1-1-10/)."},{"title":"DownThemAll! 2.0 beta 1","date":"2010-04-05","md_body":"We are proud to release the first preview of the upcoming next major version of DownThemAll!.\n\nMore than 1 year of development passed since the last major version. This was mostly due to time constraints, as DownThemAll! is still developed by a small team of three as a hobbyist project.\n\nLots of new features and refinements went into this preview release, such as speed limits, mirror management, fine-grained connection control, text-link recognition and many more.\n\n**→ [Download and release notes](http://www.downthemall.net/main/install-it/downthemall-2-0-beta-1/)**\n\nAs this is preview software, some features might be still missing or incomplete. Bugs have to be expected.     \n\nPlease report any issues you find back to our [bug tracker](http://bugs.code.downthemall.net/trac).\n\nThanks for testing!"},{"title":"DownThemAll! 1.1.9 released","date":"2010-03-26","md_body":"We released DownThemAll! Version 1.1.9, which is a maintenance and bugfix release.\n\nWe fixes some rare situation where the preallocator did not kick in (resuming a not fully allocated file), which caused even worse Firefox hangs than without preallocator.     \n\nWe also fixed some issues with using DownThemAll! in combination with a dark theme (some dark themes might still not work in some parts; we either fix issues ourselves or notify the theme authors as issues become known).     \n\nThen there were a few reports that Firefox might not correctly start up after installation, which seems to be caused by the initial notice window we shown after fresh installations or major upgrades. We disabled this for now, to see how that goes.     \n\nVersion 2.0 will not have any such window anymore; instead we’re in the process to create a first run page detailing some basic usage.     \n\nWindows 7 users observing high memory usage should also have a look at the release notes; We detail the situation there and link the hotfix Microsoft issued.\n\nYou can get it on [addons.mozilla.org](https://addons.mozilla.org/firefox/201/). You may also want to check out our [release notes](http://www.downthemall.net/main/install-it/downthemall-1-1-9/)."},{"title":"About.com Reader’s Choice Awards","date":"2010-02-03","md_body":"[![](http://code.downthemall.net/img/rca.png)](http://browsers.about.com/od/allaboutwebbrowsers/ss/2010-readers-choice-awards-web-browsers-voting_4.htm)     \n\nDownThemAll! got nominated in the About.com Reader’s Choice Awards in the category **Best Overall Add-On (Non-Security)**\n.\n\nNow it’s up to you to [vote for DownThemAll!](http://browsers.about.com/od/allaboutwebbrowsers/ss/2010-readers-choice-awards-web-browsers-voting_4.htm) ;)\n\nThe competition is very strong, which makes it even more remarkable that we got nominated, and we certainly cannot beat Adblock Plus (which got my vote; don’t vote for yourself). But being in the top 5 already is a great sign of your, the DownThemAll! users, support and trust.     \n\nThank you very much for that!\n\nFor those wondering: The next major release is still in the works, and makes pretty good progress. Expect a first official Beta version in the next few weeks. Or try the development version already using a [nightly build](http://bugs.code.downthemall.net/trac/wiki/NightlyBuilds)."},{"title":"First DownThemAll! release in 2010.","date":"2010-01-11","md_body":"We’re proud to release DownThemAll! 1.1.8, which is a bugfix release.\n\nWe corrected some issues with the integration into Firefox Privacy Controls (Clear private data and such), and furthermore fixed a bug with resuming downloads after being redirected from HTTP to FTP.     \n\nSome other minor changes went in as well.\n\nYou can get it on [addons.mozilla.org](https://addons.mozilla.org/firefox/201/). You may also want to check out our [release notes](http://www.downthemall.net/main/install-it/downthemall-1-1-8/)."},{"title":"Video tutorial in Spanish","date":"2010-01-09","md_body":"One of our users dropped us a mail saying that he made a DownThemAll! video tutorial for people who speak Spanish.     \n\nUnfortunately I don’t speak Spanish myself, so I do not really understand what he says, but the video looks good.     \n\nEnjoy ;)     \n\nMany thanks to meneameland\n\n\nCheck out his [blog](http://meneameland.com/podcast/noepisodio-05-downthemall/) for downloads of this video in other formats.\n\nOf course, there are many other videos in all kinds of languages on [YouTube](http://www.youtube.com/results?search_query=downthemall)."},{"title":"Happy 2010!","date":"2010-01-02","md_body":"The DownThemAll! Team hopes you’re spending happy holidays, and wishes you and your families an amazing 2010!"},{"title":"No Google Chrome support","date":"2009-12-10","md_body":"As more and more people are asking us for a DownThemAll! version for Google Chrome:\n\nWe won’t support Google Chrome (and Chromium for that matter) in the near future, if ever.\n\nThere are multiple reasons not to support Google Chrome (at the moment):\n\n* While support for some types of extensions was added to Chrome just recently, the extension system in Chrome simply doesn’t cut it. It is only very limited in what you can do. **Right now there is no way to port dTa over without losing the majority of functionality**\n.\n\n* Even if there were the technical means to port dTa! to Google Chrome, we still wouldn’t have the time and resources to support it.\nRight now we’re in the middle of university studies or only recently completed our degrees and hence need to “settle” for a real-life work. Some of us are now family men.\n\nAs you clearly noticed the number of dTa! releases was always low with only a major release once a year. Due to these time constraints we don’t think we can handle supporting yet another application.\n\n* We are not yet sure about the privacy in Chrome. Chrome itself is closed source (not to confuse with the Chromium basis, which is open source) and it can only be guessed what happens “behind the scenes”. Google Chrome is known to transmit data back to the google servers. This kept us away from using Google Chrome, although we watched the progress made so far.\n\n* Lastly, we are still Mozilla supporters.     \n\nWhile this surely won’t keep us away from a Chrome port, it surely does not provide us with a lot of motivation to code for Google Chrome.     \n\nNot only is Firefox the superior browser in our opinion, the Mozilla Foundation and Co. and the great people in the Mozilla community – developers, translators, designers, users and all the other folks – and the truly “open” mindset keep us in the Mozilla base. ;)Thanks for your interest in a dTa! version for Google Chrome, but we have to pass at this time.     \n\nNils\n\nUpdate 2009/12/11:     \n\nHere is Giorgio Maones take on the Chrome extension system, with some explanation why there are no NoScript or decent ad-blockers for Google Chrome yet:\n\nhttp://hackademix.net/2009/12/10/why-chrome-has-no-noscript/"},{"title":"Five years later.","date":"2009-11-12","md_body":"Five years of Firefox. 5. It seems like yesterday when we released DownThemAll! for the first time.\n\nA long time has gone, and dTa has grown up along with Firefox, in the common purpose to improve the web experience of Internet users. Firefox’s got more than 25% of the browsers’ market starting from zero, and most of all it has made the web better, safer and faster.\n\nWe as add-on developers, you as users, promoters, translators and donors have been part of this miracle, and we all have had our role in making this world a little better.\n\nWe want to thank Mozilla for having built such a great piece of software, and DownThemAll! users for their support and their more-than-30-million downloads.\n\nWell done, mates. We’re a great team.\n\n[![Spread Firefox Affiliate Button](http://sfx-images.mozilla.org/mozilla/mozilla180x60.png)](http://www.mozilla.org/contribute?from=sfx&uid=0&t=546)"},{"title":"DownThemAll! 1.1.7 with Seamonkey 2 support","date":"2009-10-27","md_body":"DownThemAll! 1.1.7 is now available.     \n\nThis version is the first to officially support [Seamonkey 2](http://weblogs.mozillazine.org/seamonkey/archives/2009/10/seamonkey_20_th.html). We’d like to thank the Seamonkey developers for their hard work and congratulate them for the release.\n\nOther than this we updated locales and added es-GL and tr-TR.\n\nYou can find [details here](http://www.downthemall.net/main/install-it/downthemall-1-1-7/), and [download it here](https://addons.mozilla.org/firefox/addon/201)."},{"title":"DownThemAll! 1.1.6 bugfix release","date":"2009-09-17","md_body":"DownThemAll! 1.1.6 is now available.     \n\nThe new preallocator code introduced in the last release contains a bug where temporary files will be recreated if an previously completed download is gone but still in the list when the manager is reopened. Only large files were recreated.     \n\nVersion 1.1.6 fixes this.\n\nWe are sorry for any inconveniences this might have caused.\n\nYou can find details [here](http://www.downthemall.net/main/install-it/downthemall-1-1-6/), and download it [here](https://addons.mozilla.org/firefox/addon/201)."},{"title":"DownThemAll! 1.1.5","date":"2009-09-16","md_body":"DownThemAll! 1.1.5 is now available.     \n\nThe most notable change is the use of a new pre-allocator, that will not block the user interface that much anymore while allocating large downloads on the disk, making the application more responsive.\n\nAlso some other issues where fixed.     \n\nYou can find details [here](http://www.downthemall.net/main/install-it/downthemall-1-1-5/), and download it [here](https://addons.mozilla.org/firefox/addon/201)."},{"title":"DownThemAll! 1.1.4","date":"2009-06-30","md_body":"DownThemAll! 1.1.4 is now available.\n\nWe fixed some compatibility glitches with Firefox 3.5 and updated some languages.\n\nYou can find details [here](http://www.downthemall.net/main/install-it/downthemall-114/), and download it [here](https://addons.mozilla.org/firefox/addon/201)."},{"title":"DownThemAll! 1.1.3","date":"2009-05-08","md_body":"DownThemAll! 1.1.3 is now available. We’ve fixed a bug about speed graphs and we’ve added Welsh localization.\n\nYou can find details [here](http://www.downthemall.net/main/install-it/downthemall-113/), and download it [here](https://addons.mozilla.org/firefox/addon/201)."},{"title":"Can I trust NoScript any longer?","date":"2009-05-02","md_body":"Giorgio Maone, the author of NoScript, recently released an update that actively and intensionally crippled Adblock Plus.     \n\nThe piece of code responsible was reportedly obfuscated to make it hard to find and analyze.     \n\nRead the [post of Wladmir Palant](http://adblockplus.org/blog/attention-noscript-users), the author of Adblock Plus, and what [Giorgio has to say](http://forums.informaction.com/viewtopic.php?f=7&t=877).\n\nGiorgio later reverted these changes (under pressure it seems), but started to forcefully add a filter subscription to white-list his domains, without asking for user consent, of course.     \n\nThe latest release at least lets the user “opt-out”.\n\nFrankly, I find both, first the intensional crippling of Adblock Plus, and then adding some filter subscription without consent, disturbing and unacceptable.\n\nI’d expect Giorgio to stop defending his previous actions and instead admitting his wrong-doing and issuing a public apology to the users.\n\nNils\n\n**Update, 2nd of May:**\n\nFrom the NoScript FAQ\n\n> Version 1.9.2.6 (released May the 1st 2009) automatically and permanently removes the filter on startup, no questions asked. This decision has been taken as a sign of good will and apologizes, after the lack of a prompt asking beforehand prior version 1.9.2.5 caused complaints and controversy in the Mozilla community.\n\nSo the filter subscription is gone again, and there is kind of an apology.     \n\nHowever it still feels, after reading this, that Giorgio didn’t get the point, exactly.     \n\nWhy didn’t he address the initial “patching” of Adblock Plus code?     \n\nIs it just because of the complaints and “controversy” that he reverted the changes again, or does he now see how he betrayed user trust?\n\nI don’t have any problem with NoScript adding a filter subscription, as long as it is in a transparent manner and the user can properly opt-out, far better even has to opt-in.     \n\nA lot of other users seem to agree. If there was some choice along the lines of “Want to support NoScript by allowing to displayed Noscript website ads in Adblock Plus” (Yes/No), a lot of users would have chosen yes.\n\n**Update2, 2nd of May:**\n     \n\nSeems Giorgio indeed got the point. See this [forum post](http://forums.informaction.com/viewtopic.php?f=7&t=877&start=150#p3471).     \n\nStill makes me wonder how it can happen that a “security” software developer implements and releases code that easily can be classified as “malware”…"},{"title":"AntiContainer with easy installation of third party plugins","date":"2009-04-19","md_body":"AntiContainer is an extension and framework to DownThemAll! which allows the user to download resources that are normally hidden behind container pages.\n\nFor example it is possible to download images directly from those one-click image hosters, provided an appropriate plugin exists.\n\nVersion 0.6., which I just released, includes an easy way for plugin authors to share their plugins and users to install those plugins, either from file or directly from the web.\n\nCheck out the [AntiContainer page](http://bugs.code.downthemall.net/trac/wiki/AntiContainer) for the download and more information.     \n[(more…)](http://www.downthemall.net/latest/anticontainer-with-easy-installation-of-third-party-plugins/#more-246)"},{"title":"Emergency: italian earthquake","date":"2009-04-09","md_body":"![](/images/spot/redcross.png)On April 6th a major earthquake hit central Italy, killing 279 people so far and leaving 29000 homeless. Some towns were completely destroyed. We ask you to help Italian Red Cross to support people in need. You can donate via PayPal from [this page](http://www.cri.it/donazioni/index.php?modo=form&version=e&paypal=on) on Italian Red Cross website: select “Sisma Abruzzo – Aprile 2009″ as donation cause.\n\nThank you for being generous. [Donate now.](http://www.cri.it/donazioni/index.php?modo=form&version=e&paypal=on)"},{"title":"Download even more with AntiContainer","date":"2009-04-07","md_body":"AntiContainer is an extension and framework to DownThemAll! which allows the user to download resources that are normally hidden behind container pages.\n\nFor instance almost all so called “one-click” image hosters, such as imagevenue, use such container pages. AntiContainer enables DownThemAll! to download the actual images there instead of just the page.\n\nHence it is now possible to use DownThemAll! to mass-download from image hosters and other services.     \n\nCurrently there are 38 plugins, including one for blogger.com images and others for the most common image hosters.\n\n**For the download and more information about usage and writing plugins yourself see the [AntiContainer page](http://bugs.code.downthemall.net/trac/wiki/AntiContainer).**\n\nThe current version is still a test release. So please test a lot and give feedback if anything doesn’t work or is missing."},{"title":"DownThemAll! 1.1.2","date":"2009-03-24","md_body":"A new release of dTa! has been made available today to fix a compatibility issue with other extensions.\n\nYou can learn more [here](http://www.downthemall.net/main/install-it/downthemall-112/), and get it from [Mozilla Add-ons](https://addons.mozilla.org/en-US/firefox/addon/201) or from our [local mirror](http://www.downthemall.net/main/install-it/dta-112-local-mirror/)."},{"title":"DownThemAll! 1.1.1","date":"2009-03-17","md_body":"Yes, DownThemAll! 1.1.1 is now available. This release comes with new languages and a few bug fixes.\n\nRead our [Release Notes](http://www.downthemall.net/main/install-it/downthemall-111/) for more information.     \n\nDownloads are available from [addons.mozilla.org](https://addons.mozilla.org/firefox/addon/201) or our [local mirror](http://www.downthemall.net/main/install-it/dta-111-local-mirror/)."},{"title":"DownThemAll! 1.1","date":"2008-12-31","md_body":"We’re proud to release DownThemAll! 1.1.     \n\nA lot of new features have been added and a lot of new major and minor fixes were made.\n\nRead our [Release Notes](/main/install-it/downthemall-11/) for more information.     \n\nDownloads are available from [addons.mozilla.org](https://addons.mozilla.org/firefox/addon/201) or our [local mirror](/main/install-it/dta-11-local-mirror/).\n\nThe team wishes all of our contributors, translators and users a Happy New Year 2009."},{"title":"DownThemAll! 1.1 Beta2 released incl. first translations.","date":"2008-12-27","md_body":"We’d like to ask the community to test drive the second and likely last Beta release of the next DownThemAll! version.     \n\nPlease consider participating to help us deliver a rock stable final release version end of this year.\n\n* Make sure your application is supported.     \n\ndTa 1.1 is compatible with mozilla 1.9.1 based applications, in particular Firefox 3 or later, Shredder (Thunderbird 3), Flock 2, Songbird 1.\n\n* [Download and install 1.1 Beta2](http://code.downthemall.net/releases/downthemall-1.1b2.xpi).\n\n* Test as much as possible and [report any bugs](http://bugs.code.downthemall.net).Please see the [preliminary change log](http://bugs.code.downthemall.net/trac/wiki/ChangeLog/1.1) for detailed information what changed.\n\nThis release already includes translations for:\n\n* bg-BG\n\n* de-DE\n\n* el-GR\n\n* en-US\n\n* es-ES\n\n* fr-FR\n\n* mk-MK\n\n* nl-NL\n\n* pl-PL\n\n* sk-SK\n\n* vi-VN\n\n* zh-CNYou may also help translating dTa to other languages. Just head over to [Babelzilla](http://www.babelzilla.org/) where the translators community translates numerous extensions, not just dTa, discusses and organizes.\n\nThe final release is expected for the end of this year.\n\nThanks in advance for your participation."},{"title":"DownThemAll! 1.1 Beta 1","date":"2008-12-18","md_body":"We’d like to ask the community to test drive the first Beta release of the next DownThemAll! version.     \n\nPlease consider participating to help us deliver a rock stable final release version end of this year.\n\n* Make sure your application is supported.     \n\ndTa 1.1 is compatible with mozilla 1.9.1 based applications, in particular Firefox 3 or later, Shredder (Thunderbird 3), Flock 2, Songbird 1.\n\n* [Download and install 1.1 Beta1](http://code.downthemall.net/releases/downthemall-1.1b1.xpi).\n\n* Test as much as possible and [report any bugs](http://bugs.code.downthemall.net).Beta 1 is en-US only. Please see the [preliminary change log](http://bugs.code.downthemall.net/trac/wiki/ChangeLog/1.1) for detailed information what changed.\n\nThere will be a Beta 2 shortly afterwards addressing any issues remaining in this Beta and adding translations.     \n\nYou may also help translating dTa to other languages. Just head over to [Babelzilla](http://www.babelzilla.org/) where the translators community translates numerous extensions, not just dTa, discusses and organizes.\n\nThe final release is expected for the end of this year.\n\nThanks in advance for your participation."},{"title":"DownThemAll! 1.0.4 released.","date":"2008-12-09","md_body":"The DownThemAll! team just released version 1.0.4, which is a bugfix version only.\n\nGrab your copy over at [addons.mozilla.org](https://addons.mozilla.org/firefox/201/) or use our [local mirror](http://www.downthemall.net/main/install-it/dta-10-local-mirror/).\n\n[Release notes](http://www.downthemall.net/main/install-it/downthemall-104/) are available, too.\n\nOther than this stay tuned for the first Beta of dTa! 1.1, which will be released in the next few days."},{"title":"Source code and bugs’ database back on-line","date":"2008-07-23","md_body":"We’ve moved our svn repository and bugs’ database to a new server, and, as many of you have noticed, this has taken a while.\n\nWe’re happy to inform you that source code and bugs’ DB are now available."},{"title":"DownThemAll! 1.0.3","date":"2008-06-09","md_body":"DownThemAll! 1.0.3, released last Saturday, fixes a blocker bug introduced in 1.0.2.\n\nDetails are available [here](http://www.downthemall.net/main/install-it/downthemall-102/)."},{"title":"DownThemAll! 1.0.2","date":"2008-06-06","md_body":"DownThemAll! 1.0.2 is now available to the public. This version contains several bug fixes and four new languages: Bulgarian, Galician, Serbian (Cyrillic) and Ukrainian.\n\nCheck [release notes](http://www.downthemall.net/main/install-it/downthemall-102/) out to learn more."},{"title":"DownThemAll! 1.0.1 available now","date":"2008-04-15","md_body":"Ladies and gentlemen,     \n\nthe dTa Team just release version 1.0.1, the first bug correction release for the 1.0 series.\n\nWe corrected several bugs and regression that unfortunately went into 1.0.     \n\nThanks for all the reports we received and that helped us improve dTa.\n\nRead the [Release Notes](/main/install-it/downthemall-101/)."},{"title":"DownThemAll! 1.0, now available.","date":"2008-02-29","md_body":"Ladies and gentlemen,     \n\nthe dTa Team is proud to introduce you to **DownThemAll! 1.0**\n. This is the best DownThemAll! version ever.\n\nIt’s **faster**\n, due to an improved chunks management and a better queue book-keeping. It’s **more stable**\n, thanks to his new download core and to a smarter error handling. It offers **new interesting features**\n, like support of [metalink](http://metalinker.org/), checksums and [LinkFingerprints](http://bugs.code.downthemall.net/trac/wiki/LinkFingerprints).\n\n**We want to thank every single user**\n: your support, your suggestions, your contributions, your donations and your patience made this possible.\n\nIt’s been a long waiting, but we are sure you will enjoy this milestone. In the meanwhile, we’re already working on next version, which [you can check out here](http://bugs.code.downthemall.net/trac/wiki/NightlyBuilds).\n\n[More information here](http://www.downthemall.net/main/install-it/downthemall-10/)."},{"title":"1,278,074 people can’t be wrong.","date":"2008-02-22","md_body":"Dear friends,     \n\nwe’re happy to inform you that **DownThemAll! 1.0 release**\n is very very close to be published.\n\nIn the meanwhile, we’ve known from Mozilla that **almost 1,300,000 people were using DTA last week**\n. That’s a huge result, and we want to thank you for your choice and your support.\n\nStay tuned, DTA 1.0 is coming."},{"title":"Security Statement","date":"2008-02-14","md_body":"Google flagged our site as a potential cause of malware infection last week.     \n\nAfter a complete check up of the site structure, we’ve found that an attacker had exploited a WordPress vulnerability to inoculate unauthorized code into our theme. This code contained links to a site which tried to install malicious code on visitor’s computer.     \n\nAs far as we know this malware operates on an old vulnerability of **Windows 98**\n, **Windows Millennium Edition**\n and **Windows 2000**\n. Furthermore it is believed that Firefox users weren’t at risk at all. A patch was released in 2005. You can read details [here](http://www.trendmicro.com/vinfo/secadvisories/default6.asp?VName=(MS05-024)+Vulnerability+in+Web+View+Could+Allow+Remote+Code+Execution+(894320)).\n\nThis site has been secured, and you can visit it with confidence.\n\nEven though nobody is known to be infected by this software, we apologize with our users and visitors for any trouble we might have caused."},{"title":"Happy Holidays!","date":"2007-12-24","md_body":"Best wishes to our users, friends and their families."},{"title":"DownThemAll! 1.0 Beta 2","date":"2007-08-29","md_body":"So, did you enjoy your summer? Your tan is amazing? Great.\n\nNow you can celebrate your return to your beloved computer testing dTa! 1.0 Beta 2.     \n\nYou can find [here](http://www.downthemall.net/main/install-it/downthemall-10-beta/) all info."},{"title":"DownThemAll! 1.0 Beta","date":"2007-07-09","md_body":"Ladies and Gentlemen,     \n     \n\nwe’re proud to announce that DownThemAll! 1.0 Beta 1 is eventually available for Firefox, Thunderbird, Seamonkey, Flock and Netscape.\n\nRemember: it’s beta software, and even if it seems to be pretty stable, it could have a few bugs, so use it for testing purposes only.\n\n[Become a beta-tester](http://www.downthemall.net/main/install-it/downthemall-10-beta/)."},{"title":"DownThemAll! 0.9.9.10","date":"2007-05-22","md_body":"Slovenian friends, we’re so sorry for the troubles caused by dTa 0.9.9.9. Now your local version works as it should.\n\nFixed bugs:\n\n* [#156](http://bugs.code.downthemall.net/trac/ticket/156), troubles with Slovenian version\n\n* [#163](http://bugs.code.downthemall.net/trac/ticket/163), PayPal button doesn’t work"},{"title":"DownThemAll! 0.9.9.9","date":"2007-05-18","md_body":"dTa 0.9.9.9 is available for download.     \n\nNew in this version:\n\nBugs fixed:\n\n* [#122](http://bugs.code.downthemall.net/trac/ticket/122) – Downloads won’t start – DTA 0.9.9.8\n\n* [#124](http://bugs.code.downthemall.net/trac/ticket/124) – Chrome error when viewing properties of active download in DTANew localizations:\n\n* Slovenian (sl-SL)"},{"title":"DownThemAll! 0.9.9.8","date":"2007-04-30","md_body":"Did you miss us? Here we are with a new version!      \n     \n\nA few bug fixes and five new languages are available in this version!\n\nBugs fixed:\n\n* Preference window appearence\n\n* SaveAs\n\n* AddURL\n\n* Sanitizer/CPD integrationNew localizations:\n\n* Finnish (fi-FI)\n\n* Malay (ms-MY)\n\n* Romanian (ro-RO)\n\n* Thai (th-TH)\n\n* Turkish (tr-TR)… and a rewritten version of Macedonian!\n\nIf you’re questioning about 1.0 release, yes, we’re still working on it, and as soon as ready we will offer you a great piece of software :)\n\nStay tuned (and spread the word)."},{"title":"New repository and bug tracker","date":"2007-02-12","md_body":"You can now read our source code at the new address [http://code.downthemall.net](http://code.downthemall.net)\n\nIf you want to inform us about a new bug, you can go to [http://bugs.code.downthemall.net](http://bugs.code.downthemall.net).      \nBe sure to check the [old bugs database](http://bugs.code.downthemall.net) first, which remains available for reading (don’t post new bugs there).\n\nWe want to thank [MozDev](http://www.mozdev.org) for hosting us for such a long time."},{"title":"You wanted it, you got it.","date":"2006-10-09","md_body":"From the very next release – and on CVS already – DTA will be able to filter and start downloads of just the selected part of the page, increasing usability and filtering speed. But there is even more. If you will right-click on any image contained on a webpage, a gorgeous, brand new “Download image with dTa on…”/”Start image with DtaOneClick!” option will be shown :)     \n\nStay tuned!"},{"title":"DownThemAll! 0.9.9.7","date":"2006-10-06","md_body":"A lot of bug fixes and a pair of good improvements are available in this version.\n\nWe’re finally offering a **batch download**\n function: just click on Add URL in the dTa! Manager and write something like http://www.mysite.com/filename[01-09 step:2].jpg. dTa will download all the files from filename01.jpg to filename09.jpg, increasing the final number by two per step!\n\nOh, we haven’t mentioned that dTa is now fully compatible with Firefox 2.0 ;)\n\nImprovements:\n\n* Batch download;\n\n* “Remove completed tasks” option in context menuBug fixes:\n\n* #15315: Resume function restarts task if multipart is disabled;\n\n* #15285: UnknownContentType changed in FX2.0 so that dTa opens are hidden;\n\n* #15216: Optimized regular expressions;\n\n* #15272: “Resume” & “Pause” buttons inactive yet functional;\n\n* #15223, #15076, #15141, #15200, #14889: Various directory creation issues;\n\n* #15051: Wrong naming with underscores in file extension;\n\n* #15105: Wrong naming when downloading PDFs from Google;\n\n* #15295: Make “Close Source Tab” consistent to FX2.0 and really close for 1.5;"},{"title":"Donate in English","date":"2006-09-27","md_body":"Many users have written us about a problem in the donation mask: occasionally it has popped up in Italian. Now the problem should be fixed, and you will all be able to understand how to make a donation.\n\nBe generous ;)"},{"title":"DownThemAll! 0.9.9.6.5","date":"2006-09-16","md_body":"Here you are a few new languages and little bug fixes\n\n* bugfix: “tab.frames has no properties” message error;\n\n* bugfix: missing default value in renaming mask’s persistence broke dTaOneClick under certain conditions;\n\n* minor bugfixes.\n\n* Added cs-CZ locale;\n\n* Added uk-UA locale;\n\n* Added hr-HR locale."},{"title":"Sorry for the downtime","date":"2006-08-24","md_body":"We apologize the downtime we had for some hours. This was due to the moving into another physical location. Now everything should work fine."},{"title":"DownThemAll! 0.9.9.6.3","date":"2006-08-02","md_body":"A little but important bug – which was causing serious troubles to the dTa Manager – has been fixed.\n\nThe update is **strongly encouraged**\n.\n\n* bugfix #14786: loading history.xml will fail in many cases;\n\n* bugfix #14785: refinements in formatBytes()."},{"title":"DownThemAll! 0.9.9.6.2","date":"2006-07-30","md_body":"No more troubles with Firefox 1.5.0.5: you can download massively again! :)     \nBugs in decoding non-western charsets were also fixed.\n\nThe update is **strongly encouraged**\n.\n\n* bugfix #14751: dTaOneClick doesn’t work on Firefox 1.5.0.5;\n\n* bugfix #14654, #14658: troubles decoding non-western charsets."},{"title":"Troubles with Firefox 1.5.0.5","date":"2006-07-28","md_body":"We’re aware that dTaOneClick is having troubles since the release of Firefox 1.5.0.5 . We’re already working to publish a fix during the week-end.     \n     \n\nWe’re sorry for the inconvenience."},{"title":"DownThemAll! 0.9.9.6.1","date":"2006-07-15","md_body":"This version fixes some – hopefully all :) – the problems related to unicode characters. A big thanks goes to Nils for that. We’ve also renewed some of the code and fixed minor annoying things. Complete changelog is below, as usual.     \n     \n\nWe’re very close to the long waited 1.0 version, so please remember to let us know any bug you may encounter [posting it into our Bugzilla account](http://www.downthemall.net/index.php?page_id=5).\n\n* bugfix #14146, #14634, #13175: problems visualizing and saving unicode characters;\n\n* bugfix #14473: dTa! doesn’t remember last used target directory in the ‘Add URL’ window;\n\n* bugfix #14534: remove trailing ‘-’ from subdirs and curl;\n\n* bugfix: problems under privacy preference dialog;\n\n* bugfix: problems with moving files in queue;\n\n* enhacement: added cancel button on the ‘modify renaming mask’ dialog;"},{"title":"An help for the world…","date":"2006-07-11","md_body":"…  from the Champions of the World :)\n\nSoccer apart, these are great days also because we’re starting releasing our [help documents](http://www.downthemall.net/index.php?page_id=12). :P     \n\nThere you will find the basis to start using dTa! in seconds.     \n More languages are coming soon.      \nIf you still have questions, write us, we are preparing a technical FAQ page to help you some more."},{"title":"DownThemAll! 0.9.9.6","date":"2006-07-09","md_body":"It has been quite a while since the last update, but finally dTa! 0.9.9.6 is available for download!     \nThis release fixes tons of annoying bugs and also come with some great new features, such as settable temporary directory, a brand new help section and an advanced “prealloc” option that drastically reduces disk fragmentation for your downloads!\n\nThe update is **strongly encouraged**\n.\n\n* bugfix #14393, #14579: downloading problems with gzipped files;\n\n* bugfix #14338: dTa! doesn’t close source tab if it contains frames;\n\n* bugfix #14473: dTa! doesn’t remember last used target directory in the “Add URL” window;\n\n* bugfix #14399: right-click menu icons aren’t greyed when no download is selected;\n\n* bugfix #14437: ‘Renaming conflict!’ prompt is too wide when you have long download URLs;\n\n* bugfix #14522: current d/l speed indicators are not displayed for files from some servers;\n\n* bugfix #14541: resume support should not depend on Accept-Ranges;\n\n* minor bugfix: #14525;* ehnancement: added a Beginners Guide to dTa! section;\n\n* ehnancement #14492: missing insufficient space warning;\n\n* ehnancement #14538: allow users to configure temporary download location;\n\n* ehnancement #14428: allow users to prealloc files (less disk fragmentation!);\n\n* ehnancement: MineField compatibility;* 5 new locales added: ar-SA, gl-ES, sq-AL, da-DK, zh-TW;"},{"title":"DownThemAll! 0.9.9.5.1","date":"2006-06-14","md_body":"First of all, a wrong version of dTa! 0.9.9.5 was published two times in the last few days, due to our and Mozilla Addon’s fault. If you downloaded it, please, [install the correct package now available](https://addons.mozilla.org/firefox/201/).\n\ndTa! 0.9.9.5.1 fixes a critical bug which made the downloads not start, under certain conditions. It also solves a trouble which caused the failure of complete downloads on Linux and fixes “Server error” problems with downloads bigger than 4GB.     \nThe update is **strongly encouraged**\n.\n\n* bugfix: stabilized speed indicator\n\n* bugfix: #14335 (dTa doesn’t start downloads under certain conditions)\n\n* bugfix: #14223 (Linux – Most downloads fail from Google Groups)\n\n* bugfix: #14343 (DownThemAll cancels large download after it completes)\n\n* bugfix: improved handling of content-disposition header messages"},{"title":"DownThemAll! 0.9.9.4","date":"2006-06-05","md_body":"dTa 0.9.9.4 offers – finally – the Japanese locale, a pair of enhancement and an important bugfix regarding the filters’ panel… All these come in a reduced size. Enjoy.\n\n* enhancement: #13974 (history of ongoing/inqueue downloads is now stored in the Firefox, to avoid its deletion on upgrade)\n\n* enhancement: #14208 (automatic conversion of path separators in renaming mask)\n\n* enhancement: reduced packet’s size* bugfix: #14203 (characters changed in ’_’)\n\n* bugfix: #13838 (0.9.9.3 filters pref-pane will enter infinite loop)* locale: Japanese (ja-JP) added"},{"title":"DownThemAll! 0.9.9.3","date":"2006-05-24","md_body":"dTa! 0.9.9.3 fixes an annoying bug, which was corrupting filenames when downloading from a script page. Hungarian and Macedonian languages are now available.     \n     \n\nUpgrade is strongly suggested.\n\n* locale: Hungarian (hu-HU) added\n\n* locale: Macedonian (mk-MK) added* bugfix: #14180 (script extension added  to content-disposition filenames)"},{"title":"DownThemAll! 0.9.9.2","date":"2006-05-20","md_body":"dTa! 0.9.9.2 fixes a little problem in the installation package."},{"title":"DownThemAll! 0.9.9.1","date":"2006-05-19","md_body":"dTa 0.9.9.1, available for Firefox, Thunderbird and Flock, offers you new languages, sound alerts, and a few bug fixes.\n\n**Installation tip**\n: if you are getting a “Warning: unresponsive script” alert during installation, just click on “Continue” to complete the process.\n\n* feature: Mozilla Thunderbird compatibility\n\n* feature: BonEcho compatibility\n\n* feature: sound alerts when downloads are complete/erroneous* locale: Bulgarian (bg-BG) added\n\n* locale: Chinese Simplified (zh-CN) added\n\n* locale: Hebrew (he-IL) added\n\n* locale: Slovak (sv-SE) added\n\n* locale: Welsh (cy-GB) added* bugfix: filters’ creation/deletion\n\n* minor fixesIn these days the dTa team is at 50%, due to an unexpected surgery for Stefano. We’ll have him back home in a few days, in the meanwhile our thoughts and prayers are with him."},{"title":"Benchmarks available!","date":"2006-05-10","md_body":"We’re happy to share with you our satisfaction. According to our tests, the latest versions of DownThemAll! are 23% faster than version 0.9.8.7, even on big files.\n\n[Check out the graphs](http://www.downthemall.net/?page_id=49)!"},{"title":"DownThemAll! 0.9.9.0","date":"2006-05-09","md_body":"dTa! comes with new languages, some bugfixes, a new renaming tag, and a simpler way to select files.\n\nChangelog:\n\n* feature: added *refer* renaming tag, which adds the capability of renaming files using the referrer page of the download\n\n* feature: links in “Select links” window can now be checked with a middle mouse click anywhere on the row\n\n* change: all the Date and Time renaming tags now reports the moment when downloads are inserted into the list* locale: German (de-DE) added\n\n* locale: Korean (ko-KR) added\n\n* locale: Russian (ru-RU) added\n\n* locale: Slovak (sk-SK) added\n\n* locale: Portuguese brazilian (pt-BR) added\n\n* locale: Greek (el-GR) added* bugfix: downloads with a single chunk if paused and resumed get final error\n\n* bugfix: *curl* renaming tag doesn’t work at all\n\n* bugfix: renaming problems with attachments on some vBulletin boards\n\n* bugfix: renaming problems with Yahoo Mail attachments\n\n* bugfix: preference panel cannot be closed on Macs\n\n* bugfix: dTaOneClick doesn’t rememember to queue files\n\n* bugfix: fixed problems with non-latin characters"},{"title":"DownThemAll! 0.9.8.9","date":"2006-05-05","md_body":"dTa 0.9.8.9 fixes some little bugs reported on Bugzilla and adds new locales to the XPI. We’ve also added a useful feature in “Get info” window that we hope will save you some precious time. Changelog:\n\n* feature: Ability to modify settings of multiple downloads at the same time from “Get info” window\n\n* feature: Spanish (es-ES) locale added\n\n* feature: French (fr-FR) locale added\n\n* feature: Dutch (nl-NL) locale added\n\n* feature: Polish (pl-PL) locale added\n\n* bugfix: Link in About should open Privacy notice\n\n* bugfix: Speed on status bar doesn’t refresh\n\n* bugfix: Delete filters and restore default filters didn’t work\n\n* bugfix: minVersion in install.rdf should be 1.5\n\n* bugfix: preferences panel didn’t close on Mac\n\n* bugfix: *m* renaming tag should start from 1, not 0"},{"title":"Released DownThemAll! 0.9.8.8!","date":"2006-05-03","md_body":"DownThemAll! has finally came out with a new, explosive version! Main good news are:\n\n* Greatly improved downloading performances, expecially on big files;\n\n* Optimized memory management;\n\n* Better files’ handling (completely rewritten “Get Info” window);\n\n* New preferences panel;\n\n* Simpler renaming system;\n\n* “Turbo-dTa” renamed in most self-explanatory “dTaOneClick”\n\n* Flock compatibility;\n\n* Italian localization;It’s been a long journey, but we’re about to reach our 1.0 release at last. This 0.9.8.8 is a good taste of what you can imagine in the very next future of DownThemAll. We hope you like it."},{"title":"Released DownThemAll!  0.9.8.7!","date":"2006-01-18","md_body":"What’s new in this version?\n\n* Great improvements in page scanning and in dTa “Select Links” window\n\n* GUI restyling\n\n* Solved problems with “over 100%” downloads and safer use of multipart downloading\n\n* Improved alerting system\n\n* New Privacy panel in preferences\n\n* ‘Add URL’ button added to the dTa Manager\n\n* Drag&drop URLs on dTa Manager and on dTa buttons in the toolbar.\n\n* Fixed regression with FTP links\n\n* Minor fixes and improvementsdTa doesn’t support Firefox 1.07 and previous anymore. We suggest to upgrade to Firefox 1.5. Anyway, we’ll make available again dTa 0.9.4 – the classic one :) – for Firefox 1.0.7 and previous."},{"title":"Released DownThemAll!  0.9.8.5!","date":"2006-01-04","md_body":"Changes:\n\n* Merging of large multipart-downloaded files no longer hangs Firefox (bugs #12468, #12659, #12345)\n\n* Fixed “SyntaxError: missing\n\nbefore statement” when right-click on page (bug #12610)\n\n* Header sniffing procedure completely rewritten (bug #11630)\n\n* HTTPS links are now correctly found on web pages (bug #12533)\n\n* Fixed saving problems of the additional filter (bug #12537)\n\n* Fixed conflicts in FF “Save with…” dialog with Flashgot installed (bug #12465)\n\n* Destination dir gets now saved also if user presses the Cancel button under DTA “Select links” window (bug #12400)\n\n* Fixed unneeded discarding of DTA old preferences with new upgrades (bug #12471)\n\n* *curl* and *subdirs* tags\n\n* only if present inside the dir renaming mask\n\n* now recreate directory structure of files (request #12474)\n\n* Added Referer-header to HEAD request (bug #11630)\n\n* Fixed naming problems on vBulletin and similar PHP delivered files (bug #12425)\n\n* Recursive search of link on framed pages\n\n* Internal messages dumped on JS Console are now disabled by default (to enable them, extensions.dta.directory.visibledump=true) (request #12579)\n\n* If DTA “Download manager” window is already opened, pressing the relative toolbar button provocates focus\n\n* Solved some timeout problems (bug #12609)\n\n* Minor improvements in renaming routines (ex. maximum length of file name)\n\n* Better error management in GZIP decompression\n\n* Added deflate decompression\n\n* The last item on the download list can now be seen (bug #12406)\n\n* Added managing of DTA items in Tools menu (bug #11056)\n\n* Fixed minor timeout bug\n\n* Download Info panel has been improved\n\n* Changed quickkeys (bug #12499)\n\n* Improved Content-Disposition recognition (bug #12425, #12551)\n\n* Improved saving preferences routines\n\n* Fixed problems with links under About window (bug #12578)"},{"title":"Released DownThemAll!  0.9.8.4!","date":"2005-12-12","md_body":"Changes:\n\n* Fixed crashes caused to nglayout;\n\n* Fixed sub-directory creation;\n\n* Fixed non-persistent directory preference;\n\n* Minor bug fixes;We remind you to post all the problems you may find with this 1.0 Preview Release at Bugzilla, specifying the url where you encountered the problem, your FF version and any other useful information."},{"title":"Released DownThemAll! 0.9.8.3!","date":"2005-12-10","md_body":"Changes:\n\n* better server error management\n\n* bug fixed in renaming\n\n* solved problem in context menu"},{"title":"Released DownThemAll 0.9.8.2!","date":"2005-12-08","md_body":"This version fixes installation problems due to “nglayout.debug.disable_xul_cache” preference set to true. It also removes some of the bugs you reported us in the last 3 days:\n\n* Resolved “window.arguments” error on Dta “Select Links” window;\n\n* Fixed recognition of links on framed pages;\n\n* Fixed recognition of links on HTML Transitional pages;"},{"title":"Released DownThemAll 0.9.8.1!","date":"2005-12-05","md_body":"Changes:\n\n* Better recognition of description tags “alt” and “title”;\n\n* Solved problems with some pages;"},{"title":"Released DownThemAll 0.9.8!","date":"2005-12-04","md_body":"Here you are the 1.0 Release Candidate version (aka 0.9.8)! This version fixes some of the problems reported on the last 72 hours on Bugzilla and Addons Mozilla:\n\n* Resolved installation problems on FF 1.0.7;\n\n* Restored old shortcuts;\n\n* Resolved bugs with image downloading;\n\n* Changed some default preferences;\n\n* Resolved Content-Length problems with some pages that use Partial-Content method;\n\n* Fixed *curl* renaming tag;Features added:\n\n* Now filesizes are expressed in KB, MB or GB depending on dimension;\n\n* You can always close the “Dta! Manager” window using ESC."},{"title":"DownThemAll 1.0RC is coming","date":"2005-05-09","md_body":"Thanks to all your precious suggestions we’re working to provide a totally revised new release of DownThemAll. Brand new user-friendly interface, huge improvements and lots of new functions are coming to your favourite browser.. Subscribe our RSS news feed and be the first to download the 1.0RC!"},{"title":"Happy Holidays!","date":"2005-01-14","md_body":"A great hug to all dTa users! We’re reading your mails and keeping track of your suggestions. Sorry if we can’t answer to all messages. Stay tuned, we’ll satisfy your expectations!"}]